IDEA Open Model
CheckResult Enumeration
Compatible with IDEA StatiCa 20.1
 The number in enum value description means the priority for extreme check evaluation.
 Namespace: IdeaRS.OpenModel.Concrete.CheckResult
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public enum CheckResult
Public Enumeration CheckResult
Members
Member name | Value | Description
Failed | 0 |  3. check value is bigger than limit check value
Passed | 1 |  5. check value is lesser than limit check value
PassedWithWarnings | 2 |  4. check value is lesser than limit check value, but there is a warning in calculation
FailedWithError | 3 |  2. error appeared during calculation, calculation was terminated
CheckIsOff | 4 |  7. this kind of the calculation was switched off
NotDone | 5 |  1. this kind of the calculation was not done
CheckIsNotNecesssary | 6 |  6. check for some reason not necessary
See Also
Reference
IdeaRS.OpenModel.Concrete.CheckResult Namespace